

	let messages = ["حاسبوا أنفسكم قبل أن تحاسبوا", "﴿ٱلَّذِینَ إِذَاۤ أَصَـٰبَتۡهُم مُّصِیبَةࣱ قَالُوۤا۟ إِنَّا لِلَّهِ وَإِنَّاۤ إِلَیۡهِ رَ ٰ⁠جِعُونَ﴾ [البقرة 156].", 
  "﴿وَأَنَّ ٱلۡمَسَـٰجِدَ لِلَّهِ فَلَا تَدۡعُوا۟ مَعَ ٱللَّهِ أَحَدࣰا * وَأَنَّهُۥ لَمَّا قَامَ عَبۡدُ ٱللَّهِ یَدۡعُوهُ كَادُوا۟ یَكُونُونَ عَلَیۡهِ لِبَدࣰا  [الجن 18 ،19].",
   " {مَا يَلْفِظُ مِنْ قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ} [ق:18].","{فَلَا تُزَكُّوا أَنفُسَكُمْ ۖ هُوَ أَعْلَمُ بِمَنِ اتَّقَىٰ} [النجم:32]","{إِنَّمَا يَخْشَى اللَّـهَ مِنْ عِبَادِهِ الْعُلَمَاءُ} [فاطر:28].",
  "{لَئِن شَكَرْ‌تُمْ لَأَزِيدَنَّكُمْ} [إبراهيم:7].","{فَاذْكُرُ‌ونِي أَذْكُرْ‌كُمْ} [البقرة:152].","إِنَّ إِلَىٰ رَبِّكَ ٱلرُّجۡعَىٰۤ ﴿ العلق 8﴾","عذر أقبح من ذنب .",
"من شب على شئ شاب عليه .","لا تؤجل عمل اليوم إلى الغد","الدهر يومان يوم لك ويوم عليك .","العجلة من الشيطان .",
"رحم الله إمرء عرف قدر نفسه .","من تدخل فيما لا يعنيه لقى ما لا يرضيه .","من راقب الناس مات هما ."," أخوك من صَدَقك لا من صدّقك .",
"وإذا كانت النفوس كباراً تعبت في مرادها الأجسام .","اطلب من العلوم علماً ينفعك ينفي الأذى والعيب ثم يرفعك ."," التجارب ليست لها نهاية والمرء منها في زيادة .",
" العلم زين فكن للعلم مكتسباً وكن له طالبًا ما عشت مقتبسا ."];

// Generate a random number between 0 and the length of the array
let randomNumber = Math.floor(Math.random() * messages.length);


let tes ='';
tes=`<p style="color:#fff">${messages[randomNumber]}</p`;

document.getElementById('message').innerHTML = tes;
// Print the message at the index of the random number


$('#bt').click(function(){
  $("#message").slideToggle();
  $("span").toggle();

});


$('#menu').click(function(){
  $("#side-menu").slideToggle();
});

  $('#close').click(function(){
    $("#side-menu").hide();
  
  
  });

// console.log("ff")  


// slide menu //
$('#dropbtn').click(function(){
  $("#dropdown-content").slideToggle();

});
// slide menu //


