let questions = new Array();

// 1
questions.push(
    new Question(
        
        "الجودة تساوي",
            [   
                "المستلم/الاجمالي",
                "المرفوض/الاجمالي",
                "السعر/الاجمالي",
            ] ,
        0   ,
            "المستلم/الاجمالي",
        5
        )
);

// 2
questions.push(
    new Question(
        
        "سرعة التسليم",
            [   
                "السعر/الاجمالي",
                "المستلم في الموعد/الاجمالي",
                "لا شئ مماسبق"
            ] ,
        1   ,
        "المستلم في الموعد/الاجمالي",
        5
        )
);



